export const mockTerms: Terms[] = [
    {
        title: "1. Общие положения",
        text: "Мини-приложение GOVNO COIN (далее — «Приложение») представляет собой экспериментальную симуляцию игровой платформы, разработанную независимой командой энтузиастов в рамках децентрализованной автономной организации (DAO) и не имеющая отношения к финансовым или инвестиционным продуктам. Используя Приложение, вы подтверждаете, что вы совершеннолетний, прочли, поняли и безоговорочно принимаете все условия, изложенные в данном Соглашении.",
        content: [
            {
                subtitle1: "",
                list: [
                    {
                        listTitle: "",
                        subList: [],
                    },
                ],
                subtitle2: "",
            },
        ],
    },
    {
        title: "2. Добровольность участия",
        content: [
            {
                subtitle1:
                    "Участие в любых функциях Приложения, включая, но не ограничиваясь:",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            'интерактивной "Говнокартой",',
                            "пулингами и турнирными событиями,",
                            "заданиями, NFT и внутриигровыми достижениями,",
                        ],
                    },
                ],
                subtitle2:
                    "осуществляется на полностью добровольной основе. <br> Вы осознаёте, что можете не получить никаких вознаграждений, потерять свои токены или доступ к Приложению, и принимаете эти риски без каких-либо претензий к разработчикам или владельцам платформы.",
            },
        ],
    },
    {
        title: "3. Отказ от ответственности",
        content: [
            {
                subtitle1:
                    'Приложение предоставляется "как есть" и "по доступности", без каких-либо гарантий, прямых или подразумеваемых.',
                list: [
                    {
                        listTitle:
                            "Мы не несем никакой ответственности, включая, но не ограничиваясь:",
                        subList: [
                            "потерей токенов или средств,",
                            "техническими сбоями, ошибками в коде, багами или задержками,",
                            "отсутствием или изменением функционала,",
                            "последствиями использования или невозможности использования Приложения.",
                        ],
                    },
                ],
                subtitle2:
                    "Даже если потери произошли в результате сбоя системы или ошибки кода — ответственность полностью лежит на пользователе.",
            },
        ],
    },
    {
        title: "4. Финансовая и юридическая оговорка",
        content: [
            {
                subtitle1: "",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "Приложение не является азартной платформой и не является букмекерской конторой.",
                            "Мы не проводим лотереи, не принимаем ставки и не обещаем никаких выплат.",
                            'Все внутриигровые "пулы", "соревнования", "прогнозы" и "вознаграждения" имеют игровой и развлекательный характер и не являются реальными инвестиционными инструментами.',
                        ],
                    },
                ],
                subtitle2: "Вся внутриигровая активность — это $GOVNO ради прикола. Если вы воспринимаете это всерьёз — просто закройте Приложение и сходите на воздух.",
            },
        ],
    },
    {
        title: "5. Принятие рисков",
        content: [
            {
                subtitle1: "Вы полностью осознаёте и принимаете, что:",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "Приложение может изменяться в любой момент без уведомления.",
                            "Любые внутриигровые награды, правила, формулы, рейтинги и доступ к функциям могут быть отменены, изменены или удалены по решению команды разработчиков.",
                            "Использование Приложения может повлечь непредсказуемые последствия, включая утрату доступа, блокировку, сбои, изменение логики работы и другие риски.",
                        ],
                    },
                ],
                subtitle2: "",
            },
        ],
    },
    {
        title: "6. Роль DAO и команды",
        content: [
            {
                subtitle1: "Приложение создано в рамках децентрализованного DAO. Все решения в рамках симуляции турниров и событий (в том числе определения победителей и распределения пулов) принимаются по усмотрению команды независимых разработчиков, чьё мнение считается окончательным и не подлежит обжалованию.",
                list: [
                    {
                        listTitle: "",
                        subList: [
                              ],
                    },
                ],
                subtitle2: "",
            },
        ],
    },
    {
        title: "7. 18+ и контентное предупреждение",
        content: [
            {
                subtitle1: "",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "Приложение может содержать юмористические, провокационные, сатирические и иные материалы, предназначенные для совершеннолетней аудитории (18+).",
                            "Цель проекта — развлекательная и геймифицированная, мы не преследуем цели оскорбить, унизить или задеть чьи-либо чувства. Всё содержание — в духе чёрного юмора и интернет-культуры.",
                        ],
                    },
                ],
                subtitle2: "",
            },
        ],
    },
    {
        title: "8. $KAKING — внутриигровая заморозка токенов",
        content: [
            {
                subtitle1:
                    "Приложение может включать различные формы $KAKING-а — уникальной игровой механики, при которой ваши токены временно скакиваются (замораживаются) внутри внутренней логики Приложения или отправляются под управление умерщвлённого DAO-смарт-контракта.",
                list: [
                    {
                        listTitle: "Вы подтверждаете, что:",
                        subList: [
                            "все действия по $какингу происходят по вашей инициативе и на ваш страх и риск;",
                            "никакие токены не подлежат возврату или компенсации, даже если произошли:\n- баг, сбой, утеря доступа, ошибка в коде,\n- изменение логики стейкинга или условий разблокировки,\n- удаление соответствующей функции из Приложения;",
                            "внутриигровые награды, достижения или плюшки за $kaking не гарантированы и могут быть изменены или отменены без предупреждения",
                            "$какинг является игровым трэш-механизмом, не связанным с инвестициями, доходностью или финансовыми услугами;",
                            "Команда DAO GOVNO COIN не обязана что-либо возвращать, объяснять, или разбираться с последствиями $kaking-а — если заскакал, значит готов к безвозвратному веселью.",
                        ],
                    },
                ],
                subtitle2:
                    "Мы не обязаны возвращать, восстанавливать или объяснять любые операции, связанные с блокировкой или разблокировкой токенов.",
            },
        ],
    },
    {
        title: "9. Искусственный интеллект и юмористический контент",
        content: [
            {
                subtitle1:
                    'Часть новостного контента внутри Приложения (в том числе "Говно-новости", "Сводки с полей", "Обновления на карте" и прочие публикации) генерируется с помощью искусственного интеллекта (ИИ) и предназначена исключительно в развлекательных, сатирических и юмористических целях.',
                list: [
                    {
                        listTitle:
                            "Вы подтверждаете и соглашаетесь с тем, что:",
                        subList: [
                            "такие материалы не являются достоверными, не претендуют на правдивость и не должны восприниматься всерьёз;",
                            "они не направлены на дискредитацию, клевету, разжигание вражды, личные выпады или провокации;",
                            "контент может содержать:\n- непристойные формулировки, грубость, чёрный юмор;\n- абсурдные, провокационные или 18+ элементы;",
                            "если вы не готовы воспринимать такие формы подачи — просто не читайте и не используйте соответствующие разделы Приложения.",
                        ],
                    },
                ],
                subtitle2:
                    "Команда проекта и DAO GOVNO COIN не несёт ответственности за последствия восприятия подобных материалов и оставляет за собой право публиковать любой контент по собственному усмотрению.",
            },
        ],
    },
    {
        title: "10. Символическая передача Души отказ от Свободы Воли",
        content: [
            {
                subtitle1:
                    "Используя Приложение, вы добровольно, осознанно и безвозвратно соглашаетесь на символическую передачу своей Души DAO GOVNO COIN, а также отказываетесь от своей Свободы Воли. Это действие:",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "совершается на добровольной основе и без возможности отмены;",
                            "не имеет юридической силы в рамках светского, религиозного, демонического или иного законодательства;",
                            "носит исключительно сатирический, абсурдный и меметичный характер, отражающий философию и эстетику проекта.",
                        ],
                    },
                    {
                        listTitle: "",
                        subList: [
                              ],
                    },
                ],
                subtitle2:
                    "Вы подтверждаете, что не возражаете против символического ритуала отчуждения Души и Свободы Воли, осознаёте последствия такого участия в трэш-комьюнити и не будете в будущем предъявлять претензии, связанные с духовным или метафизическим дискомфортом. \n Попытки вернуть Душу, обменять её, перепродать или отозвать — не принимаются. DAO GOVNO COIN оставляет за собой право использовать вашу Свободу Воли и Душу как угодно, включая, но не ограничиваясь: фаршем, эмоджи, NFT или элементом шитпостинга.",
            },
        ],
    },
    {
        title: "11. Нарушения, блокировки и ограничение доступа",
        content: [
            {
                subtitle1:
                    "Мы оставляем за собой право приостанавливать или полностью ограничивать доступ к Приложению, включая:",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "блокировку игрового аккаунта,",
                            "аннулирование внутриигровых прав и наград,",
                            "ограничение на передачу, вывод или использование токенов,",
                        ],
                    },
                    {
                        listTitle: "в следующих случаях:",
                        subList: [
                            "попытки взлома, эксплуатации багов, манипуляции механиками или нарушения игрового баланса;",
                            "использование автоматизированных скриптов или ботов для получения преимуществ;",
                            "оскорбительное, токсичное, угрожающее или провокационное поведение в отношении других участников или команды проекта;",
                            "попытки обхода ограничений, запретов или блокировок;",
                            "подозрения (даже без представления доказательств) в вышеуказанных действиях — достаточны для немедленной блокировки по усмотрению команды.",
                        ],
                    },
                ],
                subtitle2:
                    "Решения команды DAO GOVNO COIN в вопросах блокировок, ограничений, удаления аккаунтов и аннулирования токенов являются окончательными, не подлежат обжалованию и не требуют объяснений.",
            },
        ],
    },
    {
        title: "12. Заключительные положения",
        content: [
            {
                subtitle1:
                    "",
                list: [
                    {
                        listTitle: "",
                        subList: [
                            "Использование вами Приложения означает полное и безусловное принятие всех условий данного Соглашения.",
                            "Мы рекомендуем не использовать Приложение, если вы не согласны с каким-либо из условий.",
                        ],
                    },
                ],
                subtitle2: "Команда оставляет за собой право в любое время вносить изменения в настоящее Соглашение, без предварительного уведомления. ",
            },
        ],
    },
  
];
export const mockNews: News[] = [
    {
        title: "$GOVNO Challenge: реальные деньги за виртуальные потери",
        content:
            "Стартап $GOVNO VR проводит ежемесячный конкурс для трейдеров в виртуальной реальности. Участники сталкиваются с симулированными сценариями крипто-кризисов. Побеждает тот, кто минимизирует потери, получая реальные $GOVNO в качестве приза.",
        source: "CryptoSim Games Blog",
    },
    {
        title: "$GOVNO запускает 'Блокчейн без прикрас'",
        content:
            "Новый проект $GOVNO предлагает уникальную модель блокчейна, где транзакции являются публичными и верифицируемыми всеми участниками сети, обеспечивая абсолютную прозрачность и отсутствие скрытых сборов.",
        source: "TransparentChain Community",
    },
    {
        title: "Утечка кода в DAO $GOVNO раскрыла уязвимости",
        content:
            "Критический баг обнаружен в коде $GOVNO DAO, благодаря утечке на GitHub. Уязвимость позволяла злоумышленникам манипулировать голосованиями. Разработчики устраняют проблему, общество требует компенсаций.",
        source: "LeakTech News",
    },
    {
        title: "TON на коленях: $GOVNO криптовалюта демонстрирует рост в 300%",
        content:
            "Внезапный рост криптовалюты $GOVNO на 300% вызвал шок у инвесторов TON после того, как Павел Дуров случайно лайкнул твит о стремительном росте $GOVNO, что подняло волну интереса к монете.",
        source: "CryptoCrunch App",
    },
    {
        title: "$GOVNO теперь можно заправлять авто в Сингапуре",
        content:
            "Запуск новой услуги в Сингапуре позволяет автовладельцам использовать криптовалюту $GOVNO для оплаты топлива на выбранных станциях. Это первый в мире эксперимент по использованию крипто на АЗС.",
        source: "FuelCrypto Station Blog",
    },
    {
        title: "Инвесторы бросили фиат за $GOVNO",
        content:
            "Новый тренд среди инвесторов - обмен фиатных валют на криптовалюту $GOVNO. Увеличение оборота монеты на 150% последний месяц говорит о начале новой эры в инвестициях.",
        source: "InvestFuture Web",
    },
    {
        title: "$GOVNO Kits: DIY набор для крипто-фермеров",
        content:
            "Компания $GOVNO запускает наборы для самостоятельной установки крипто-ферм на домашних ПК, позволяя каждому пользователю стать частью майнинговой сети без профессионального оборудования.",
        source: "HomeMiner Forum",
    },
];
