<template>
   <div class="flex flex-col gap-4">
      <!-- Заголовок и описание -->
      <div class="flex flex-col gap-2.5">
         <h1 class="text-(length:--h2)">
            📜 Пользовательское соглашение GOVNO COIN (18+)
         </h1>
         <p class="text-(length:--support-text)">
            Вступает в силу с момента первого взаимодействия с Приложением,
            включая его загрузку, открытие или использование любых функций.
         </p>
      </div>

      <!-- Условия -->
      <div
         v-for="(term, termIndex) in terms"
         :key="termIndex"
         class="max-w-[90vw] box-border flex flex-col gap-2.5"
      >
         <h1 class="text-(length:--h4)">
            {{ term.title }}
         </h1>
         <p v-if="term.text" class="font-normal text-(length:--support-text)">
            {{ term.text }}
         </p>

         <div
            v-for="(content, contentIndex) in term.content"
            :key="contentIndex"
            class="font-normal text-(length:--support-text) text-(--support-text-color) flex flex-col items-center justify-center gap-5"
         >
            <h2 v-if="content.subtitle1">
               {{ content.subtitle1 }}
            </h2>

            <div
               v-if="content.ul"
               v-for="(ul, ulIndex) in content.ul"
               :key="ulIndex"
            >
               <p v-if="ul.ulTitle">
                  {{ ul.ulTitle }}
               </p>
               <ul>
                  <li
                     v-for="(li, liIndex) in ul.ulList"
                     :key="liIndex"
                     class="list-disc ml-6"
                  >
                     {{ li }}
                  </li>
               </ul>
            </div>

            <p v-if="content.subtitle2">
               {{ content.subtitle2 }}
            </p>
         </div>
      </div>

      <!-- Заключительное сообщение -->
      <p class="text-(length:--support-text)">
         DAO GOVNO COIN не обязано ничего никому. Добро пожаловать в Свободный
         Децентрализованный Беспредел.
      </p>

      <p class="text-(length:--support-text) text-(--support-text-color)">
         Приложение разработано децентрализованной группой разработчиков, не
         являющейся юридическим лицом. Все действия осуществляются на
         добровольной основе, вне рамок какой-либо юрисдикции.
      </p>

      <!-- Чекбокс согласия -->
      <div class="flex gap-3">
         <UCheckbox size="lg" v-model="agree" default-value @click="test()" />
         <p
            class="font-normal text-(length:--support-text) text-(--support-text-color)"
         >
            Я согласен с данными правилами
         </p>
      </div>

      <!-- Кнопка продолжения -->
      <UButton
         @click="replace()"
         :class="
            agree
               ? 'bg-(--main-blue)'
               : 'disabled:bg-(--disable-button-color) disabled:text-(--disable-text-color)'
         "
         class="h-[13.1vw] px-4.5 rounded-[3vw] text-(length:--button-text2) flex justify-between"
         trailing-icon="i-lucide-arrow-right"
         size="md"
         :disabled="!agree"
      >
         Продолжить
      </UButton>
   </div>

   <div
      class="bg-[url(/terms/terms-background.svg)] bg-size-[100vw_100vh] w-[100vw] h-[100vh] fixed left-0 top-0 bg-center -z-1"
   ></div>
</template>

<script setup lang="ts">
import { useRouter } from "vue-router";
const router = useRouter();
const agree = ref<boolean>(false);
const link = ref<HTMLElement | null>(null);

function test() {
   console.log(agree.value);
}

function replace() {
   router.push("/");
   console.log("344334");
}

const terms = [
   {
      title: "1. Общие положения",
      text: "Мини-приложение GOVNO COIN (далее — «Приложение») представляет собой экспериментальную симуляцию игровой платформы, разработанную независимой командой энтузиастов в рамках децентрализованной автономной организации (DAO) и не имеющая отношения к финансовым или инвестиционным продуктам. Используя Приложение, вы подтверждаете, что прочли, поняли и безоговорочно принимаете все условия, изложенные в данном Соглашении.",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "",
                  ulList: [],
               },
            ],
            subtitle2: "",
         },
      ],
   },
   {
      title: "2. Добровольность участия",
      content: [
         {
            subtitle1:
               "Участие в любых функциях Приложения, включая, но не ограничиваясь:",
            ul: [
               {
                  ulTitle: "",
                  ulList: [
                     'интерактивной "Говнокартой",',
                     "прогнозными событиями,",
                     "пулингами и турнирными пулами,",
                     "заданиями, NFT и внутриигровыми вознаграждениями,",
                  ],
               },
            ],
            subtitle2:
               "Вы осознаёте, что можете не получить никаких вознаграждений, потерять свои токены или доступ к Приложению, и принимаете эти риски без каких-либо претензий к разработчикам или владельцам платформы.",
         },
      ],
   },
   {
      title: "3. Отказ от ответственности",
      content: [
         {
            subtitle1:
               'Приложение предоставляется "как есть" и "по доступности", без каких-либо гарантий, прямых или подразумеваемых.',
            ul: [
               {
                  ulTitle:
                     "Мы не несем никакой ответственности, включая, но не ограничиваясь:",
                  ulList: [
                     "потерей токенов или средств,",
                     "техническими сбоями, ошибками в коде, багами или задержками,",
                     "отсутствием или изменением функционала,",
                     "последствиями использования или невозможности использования Приложения.",
                  ],
               },
            ],
            subtitle2:
               "Даже если потери произошли в результате сбоя системы или ошибки кода — ответственность полностью лежит на пользователе.",
         },
      ],
   },
   {
      title: "4. Финансовая и юридическая оговорка",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "",
                  ulList: [
                     "Приложение не является азартной платформой и не является букмекерской конторой.",
                     "Мы не проводим лотереи, не принимаем ставки и не обещаем никаких выплат.",
                     'Все внутриигровые "пулы", "соревнования", "прогнозы" и "вознаграждения" имеют игровой и развлекательный характер и не являются реальными инвестиционными инструментами.',
                  ],
               },
            ],
            subtitle2: "",
         },
      ],
   },
   {
      title: "5. Принятие рисков",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "Вы полностью осознаёте и принимаете, что:",
                  ulList: [
                     "Приложение может изменяться в любой момент без уведомления.",
                     "Любые внутриигровые награды, правила, формулы, рейтинги и доступ к функциям могут быть отменены, изменены или удалены по решению команды разработчиков.",
                     "Использование Приложения может повлечь непредсказуемые последствия, включая утрату доступа, блокировку, сбои, изменение логики работы и другие риски.",
                  ],
               },
            ],
            subtitle2: "",
         },
      ],
   },
   {
      title: "6. Роль DAO и команды",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "",
                  ulList: [
                     "Приложение создано в рамках децентрализованного DAO.",
                     "Все решения в рамках турниров и прогнозных событий (в том числе определения победителей и распределения пулов) принимаются по усмотрению команды независимых разработчиков, чьё мнение считается окончательным и не подлежит обжалованию.",
                  ],
               },
            ],
            subtitle2: "",
         },
      ],
   },
   {
      title: "7. 18+ и контентное предупреждение",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "",
                  ulList: [
                     "Приложение может содержать юмористические, провокационные, сатирические и иные материалы, предназначенные для совершеннолетней аудитории (18+).",
                     "Цель проекта — развлекательная и геймифицированная, мы не преследуем цели оскорбить, унизить или задеть чьи-либо чувства.",
                     "Всё содержание — в духе чёрного юмора и интернет-культуры.",
                  ],
               },
            ],
            subtitle2: "",
         },
      ],
   },
   {
      title: "8. $KAKING — внутриигровая заморозка токенов",
      content: [
         {
            subtitle1:
               "Приложение может включать различные формы $KAKING-а — уникальной игровой механики, при которой ваши токены временно скакиваются (замораживаются) внутри внутренней логики Приложения или отправляются под управление умерщвлённого DAO-смарт-контракта.",
            ul: [
               {
                  ulTitle: "Вы подтверждаете, что:",
                  ulList: [
                     "Все действия по $какингу происходят по вашей инициативе и на ваш страх и риск;",
                     "никакие суммы не подлежат возврату или компенсации, даже если произошли:\n- баг, сбой, утеря доступа, ошибка в коде,\n- изменение условий скакинга или механики “отскакивания”;\n- удаление функции $kaking из Приложения;",
                     "Внутриигровые награды, достижения или плюшки за $kaking не гарантированы и могут быть изменены или отменены без предупреждения;",
                     "$какинг является игровым трэш-механизмом, не связанным с инвестициями, доходностью или финансовыми услугами;",
                     "Команда DAO GOVNO COIN не обязана что-либо возвращать, объяснять, или разбираться с последствиями $kaking-а — если заскакал, значит готов к безвозвратному веселью.",
                  ],
               },
            ],
            subtitle2:
               "Мы не обязаны возвращать, восстанавливать или объяснять любые операции, связанные с блокировкой или разблокировкой токенов.",
         },
      ],
   },
   {
      title: "9. Искусственный интеллект и юмористический контент",
      content: [
         {
            subtitle1:
               'Часть новостного контента внутри Приложения (в том числе "Говно-новости", "Сводки с полей", "Обновления на карте" и прочие публикации) генерируется с помощью искусственного интеллекта (ИИ) и предназначена исключительно в развлекательных, сатирических и юмористических целях.',
            ul: [
               {
                  ulTitle: "Вы подтверждаете и соглашаетесь с тем, что:",
                  ulList: [
                     "такие материалы не являются достоверными, не претендуют на правдивость и не должны восприниматься всерьёз;",
                     "они не направлены на дискредитацию, клевету, разжигание вражды, личные выпады или провокации;",
                     "контент может содержать:\n- непристойные формулировки, грубость, чёрный юмор;\n- абсурдные, провокационные или 18+ элементы;",
                     "если вы не готовы воспринимать такие формы подачи — просто не читайте и не используйте соответствующие разделы Приложения.",
                  ],
               },
            ],
            subtitle2:
               "Команда проекта и DAO GOVNO COIN не несёт ответственности за последствия восприятия подобных материалов и оставляет за собой право публиковать любой контент по собственному усмотрению.",
         },
      ],
   },
   {
      title: "10. Символическая передача Души отказ от Свободы Воли",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle:
                     "Используя Приложение, вы добровольно, осознанно и безвозвратно соглашаетесь на символическую передачу своей Души DAO GOVNO COIN, а также отказываетесь от своей Свободы Воли. Это действие:",
                  ulList: [
                     "Совершается на добровольной основе и без возможности отмены;",
                     "Не имеет юридической силы в рамках светского, религиозного, демонического или иного законодательства;",
                     "Носит исключительно сатирический, абсурдный и меметичный характер, отражающий философию и эстетику проекта.",
                  ],
               },
            ],
            subtitle2:
               "Вы подтверждаете, что не возражаете против символического ритуала отчуждения Души и Свободы Воли, осознаёте последствия такого участия в трэш-комьюнити и не будете в будущем предъявлять претензии, связанные с духовным или метафизическим дискомфортом. \n\n Попытки вернуть Душу, обменять её, перепродать или отозвать — не принимаются. DAO GOVNO COIN оставляет за собой право использовать вашу Свободу Воли и Душу как угодно, включая, но не ограничиваясь: фаршем, эмоджи, NFT или элементом шитпостинга.",
         },
      ],
   },
   {
      title: "11. Нарушения, блокировки и ограничение доступа",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle:
                     "Мы оставляем за собой право приостанавливать или полностью ограничивать доступ к Приложению, включая:",
                  ulList: [
                     "блокировку игрового аккаунта,",
                     "аннулирование внутриигровых прав и наград,",
                     "ограничение на передачу, вывод или использование токенов,",
                  ],
               },
               {
                  ulTitle: "в следующих случаях:",
                  ulList: [
                     "попытки взлома, эксплуатации багов, манипуляции механиками или нарушения игрового баланса;",
                     "использование автоматизированных скриптов или ботов для получения преимуществ;",
                     "оскорбительное, токсичное, угрожающее или провокационное поведение в отношении других участников или команды проекта;",
                     "попытки обхода ограничений, запретов или блокировок;",
                     "подозрения (даже без представления доказательств) в вышеуказанных действиях — достаточны для немедленной блокировки по усмотрению команды.",
                  ],
               },
            ],
            subtitle2:
               "Решения команды DAO GOVNO COIN в вопросах блокировок, ограничений, удаления аккаунтов и аннулирования токенов являются окончательными, не подлежат обжалованию и не требуют объяснений. \n \n AO GOVNO COIN не обязано ничего никому. Добро пожаловать в Свободный Децентрализованный Беспредел.",
         },
      ],
   },
   {
      title: "12. Заключительные положения",
      content: [
         {
            subtitle1: "",
            ul: [
               {
                  ulTitle: "",
                  ulList: [
                     "Использование вами Приложения означает полное и безусловное принятие всех условий данного Соглашения.",
                     "Мы рекомендуем не использовать Приложение, если вы не согласны с каким-либо из условий.",
                  ],
               },
            ],
            subtitle2:
               "Команда оставляет за собой право в любое время вносить изменения в настоящее Соглашение, без предварительного уведомления.",
         },
      ],
   },
];
</script>
