<template>
  <div class="flex flex-col gap-4">
    <div class="max-w-[90vw] box-border gap-2.5 flex flex-col" v-for="(term, termIndex) in terms" :key="termIndex">
      <h1 class="text-(length:--h4)">{{ term.title }}</h1>
      <p :class="{ hidden: !term.text }" class="font-normal text-(length:--support-text)">{{ term.text }}</p>
      <div v-for="(content, contentIndex) in term.content" :key="contentIndex" class="font-normal text-(length:--support-text) text-(--support-text-color) gap-5 flex flex-col items-center justify-center">
        <h2 v-if="content.subtitle1">{{ content.subtitle1 }}</h2>
        <div v-if="content.ul" v-for="(ul, ulIndex) in content.ul" :key="ulIndex">
          <p v-if="ul.ulTitle" class="">{{ ul.ulTitle }}</p>
          <li v-if="ul.ulList" class="list-disc ml-2" v-for="(li, liIndex) in ul.ulList" :key="liIndex">{{ li }}</li>
        </div>
        <p v-if="content.subtitle2">{{ content.subtitle2 }}</p>
      </div>
    </div>
    <p class="text-(length:--h4)">DAO GOVNO COIN не обязано ничего никому. Добро пожаловать в Свободный Децентрализованный Беспредел.</p>
    <UCheckbox color="secondary" default-value label="Я согласен с данными правилами" />
  </div>

  <div class="bg-[url(/terms/terms-background.svg)] bg-size-[100vw_100vh] w-[100vw] h-[100vh] fixed left-0 top-0 bg-center -z-1"></div>
</template>

<script setup lang="ts">

const terms = [
  {
    title: '1. Общие положения',
    text: 'Мини-приложение GOVNO COIN (далее — «Приложение») представляет собой экспериментальную симуляцию игровой платформы, разработанную независимой командой энтузиастов в рамках децентрализованной автономной организации (DAO) и не имеющая отношения к финансовым или инвестиционным продуктам. Используя Приложение, вы подтверждаете, что прочли, поняли и безоговорочно принимаете все условия, изложенные в данном Соглашении.',
    content: [
      {
        subtitle1: '',
        ul: [
          {
            ulTitle: '',
            ulList: []
          }
        ],
        subtitle2: ''
      }
    ]
  },
  {
    title: '2. Добровольность участия',
    content: [
      {
        subtitle1: 'Участие в любых функциях Приложения, включая, но не ограничиваясь:',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'интерактивной "Говнокартой",',
              'прогнозными событиями,',
              'пулингами и турнирными пулами,',
              'заданиями, NFT и внутриигровыми вознаграждениями,'
            ]
          }
        ],
        subtitle2: 'Вы осознаёте, что можете не получить никаких вознаграждений, потерять свои токены или доступ к Приложению, и принимаете эти риски без каких-либо претензий к разработчикам или владельцам платформы.'
      }
    ]
  },
  {
    title: '3. Отказ от ответственности',
    content: [
      {
        subtitle1: 'Приложение предоставляется "как есть" и "по доступности", без каких-либо гарантий, прямых или подразумеваемых.',
        ul: [
          {
            ulTitle: 'Мы не несем никакой ответственности, включая, но не ограничиваясь:',
            ulList: [
              'потерей токенов или средств,',
              'техническими сбоями, ошибками в коде, багами или задержками,',
              'отсутствием или изменением функционала,',
              'последствиями использования или невозможности использования Приложения.'
            ]
          }
        ],
        subtitle2: 'Даже если потери произошли в результате сбоя системы или ошибки кода — ответственность полностью лежит на пользователе.'
      }
    ]
  },
  {
    title: '4. Финансовая и юридическая оговорка',
    content: [
      {
        subtitle1: '',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'Приложение не является азартной платформой и не является букмекерской конторой.',
              'Мы не проводим лотереи, не принимаем ставки и не обещаем никаких выплат.',
              'Все внутриигровые "пулы", "соревнования", "прогнозы" и "вознаграждения" имеют игровой и развлекательный характер и не являются реальными инвестиционными инструментами.'
            ]
          }
        ],
        subtitle2: ''
      }
    ]
  },
  {
    title: '5. Принятие рисков',
    content: [
      {
        subtitle1: 'Вы полностью осознаёте и принимаете, что:',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'Приложение может изменяться в любой момент без уведомления.',
              'Любые внутриигровые награды, правила, формулы, рейтинги и доступ к функциям могут быть отменены, изменены или удалены по решению команды разработчиков.',
              'Использование Приложения может повлечь непредсказуемые последствия, включая утрату доступа, блокировку, сбои, изменение логики работы и другие риски.'
            ]
          }
        ],
        subtitle2: ''
      }
    ]
  },
  {
    title: '6. Роль DAO и команды',
    content: [
      {
        subtitle1: '',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'Приложение создано в рамках децентрализованного DAO.',
              'Все решения в рамках турниров и прогнозных событий (в том числе определения победителей и распределения пулов) принимаются по усмотрению команды независимых разработчиков, чьё мнение считается окончательным и не подлежит обжалованию.'
            ]
          }
        ],
        subtitle2: ''
      }
    ]
  },
  {
    title: '7. 18+ и контентное предупреждение',
    content: [
      {
        subtitle1: '',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'Приложение может содержать юмористические, провокационные, сатирические и иные материалы, предназначенные для совершеннолетней аудитории (18+).',
              'Цель проекта — развлекательная и геймифицированная, мы не преследуем цели оскорбить, унизить или задеть чьи-либо чувства.',
              'Всё содержание — в духе чёрного юмора и интернет-культуры.'
            ]
          }
        ],
        subtitle2: ''
      }
    ]
  },
  {
    title: '8. Стейкинг и внутриигровые механики блокировки токенов',
    content: [
      {
        subtitle1: 'Приложение может включать различные формы стейкинга, временной блокировки, заморозки или иных игровых механик, при которых токены временно передаются под контроль смарт-контракта или системной логики.',
        ul: [
          {
            ulTitle: 'Вы подтверждаете, что:',
            ulList: [
              'все действия со стейкингом осуществляются по вашей инициативе и на ваш страх и риск;',
              'никакие суммы не подлежат возврату или компенсации, даже если произошли:\n- баг, сбой, утеря доступа, ошибка в коде,\n- изменение логики стейкинга или условий разблокировки,\n- удаление соответствующей функции из Приложения;',
              'вознаграждения в рамках стейкинга не гарантированы и могут быть отменены или пересмотрены без уведомления;',
              'Приложение не является инвестиционным продуктом, а стейкинг — элементом геймификации, не имеющим статуса финансовой услуги.'
            ]
          }
        ],
        subtitle2: 'Мы не обязаны возвращать, восстанавливать или объяснять любые операции, связанные с блокировкой или разблокировкой токенов.'
      }
    ]
  },
  {
    title: '9. Искусственный интеллект и юмористический контент',
    content: [
      {
        subtitle1: 'Часть новостного контента внутри Приложения (в том числе "Говно-новости", "Сводки с полей", "Обновления на карте" и прочие публикации) генерируется с помощью искусственного интеллекта (ИИ) и предназначена исключительно в развлекательных, сатирических и юмористических целях.',
        ul: [
          {
            ulTitle: 'Вы подтверждаете и соглашаетесь с тем, что:',
            ulList: [
              'такие материалы не являются достоверными, не претендуют на правдивость и не должны восприниматься всерьёз;',
              'они не направлены на дискредитацию, клевету, разжигание вражды, личные выпады или провокации;',
              'контент может содержать:\n- непристойные формулировки, грубость, чёрный юмор;\n- абсурдные, провокационные или 18+ элементы;',
              'если вы не готовы воспринимать такие формы подачи — просто не читайте и не используйте соответствующие разделы Приложения.'
            ]
          }
        ],
        subtitle2: 'Команда проекта и DAO GOVNO COIN не несёт ответственности за последствия восприятия подобных материалов и оставляет за собой право публиковать любой контент по собственному усмотрению.'
      }
    ]
  },
  {
    title: '10. Нарушения, блокировки и ограничение доступа',
    content: [
      {
        subtitle1: 'Мы оставляем за собой право приостанавливать или полностью ограничивать доступ к Приложению, включая:',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'блокировку игрового аккаунта,',
              'аннулирование внутриигровых прав и наград,',
              'ограничение на передачу, вывод или использование токенов,'
            ]
          },
          {
            ulTitle: 'в следующих случаях:',
            ulList: [
              'попытки взлома, эксплуатации багов, манипуляции механиками или нарушения игрового баланса;',
              'использование автоматизированных скриптов или ботов для получения преимуществ;',
              'оскорбительное, токсичное, угрожающее или провокационное поведение в отношении других участников или команды проекта;',
              'попытки обхода ограничений, запретов или блокировок;',
              'подозрения (даже без представления доказательств) в вышеуказанных действиях — достаточны для немедленной блокировки по усмотрению команды.'
            ]
          }
        ],
        subtitle2: 'Решения команды DAO GOVNO COIN в вопросах блокировок, ограничений, удаления аккаунтов и аннулирования токенов являются окончательными, не подлежат обжалованию и не требуют объяснений.'
      }
    ]
  },
  {
    title: '11. Заключительные положения',
    content: [
      {
        subtitle1: 'Использование вами Приложения означает полное и безусловное принятие всех условий данного Соглашения.',
        ul: [
          {
            ulTitle: '',
            ulList: [
              'Мы рекомендуем не использовать Приложение, если вы не согласны с каким-либо из условий.',
              'Команда оставляет за собой право в любое время вносить изменения в настоящее Соглашение, без предварительного уведомления.'
            ]
          }
        ],
        subtitle2: ''
      }
    ]
  }
];




</script>